// policy.ts
const policy = `
# 심심조각 개인정보 처리방침

### 제1조 [개인정보의 처리 목적]

심심조각(이하 "회사"라 함)은 다음의 목적을 위해 개인정보를 처리합니다. 처리한 개인정보는 다음의 목적 이외의 용도로는 사용되지 않으며, 이용 목적이 변경될 시에는 사전 동의를 구할 예정입니다.

1. **서비스 제공**: 사용자 일기 작성, AI 편지 발송, 심리상담사 매칭 서비스 제공을 위해 개인정보를 처리합니다.
2. **고객 관리**: 회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별, 인증, 회원 자격 유지, 관리, 서비스 부정 이용 방지 등을 목적으로 개인정보를 처리합니다.
3. **마케팅 및 광고에의 활용**: 신규 서비스 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 등을 목적으로 개인정보를 처리합니다.

### 제2조 [처리하는 개인정보의 항목]

회사는 회원 가입, 서비스 제공을 위해 최소한의 개인정보를 수집하며, 그 항목은 다음과 같습니다.

1. **필수항목**: 이름, 생년월일, 성별, 휴대전화 번호, 이메일 주소, 사용자 ID, 비밀번호
2. **선택항목**: 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보

### 제3조 [개인정보의 처리 및 보유 기간]

회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의받은 개인정보 보유·이용기간 내에서 개인정보를 처리·보유합니다.

1. **회원가입 정보**: 회원 탈퇴 시까지
2. **서비스 제공 관련 정보**: 서비스 제공 완료 후 5년
3. **마케팅 및 광고 관련 정보**: 정보 제공 동의 후 1년

### 제4조 [개인정보의 제3자 제공]

회사는 정보주체의 개인정보를 제1조의 개인정보 처리 목적에서 명시한 범위 내에서만 처리하며, 정보주체의 사전 동의 없이 본래의 범위를 초과하여 처리하거나 제3자에게 제공하지 않습니다. 다만, 다음의 경우에는 예외로 합니다.

1. 정보주체가 사전에 동의한 경우
2. 법령의 규정에 의거하거나, 수사 목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우

### 제5조 [개인정보처리의 위탁]

회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보 처리업무를 위탁하고 있습니다.

1. **수탁자**
    - 심리상담사
    - 예술작가
2. **위탁업무의 내용**
    - 심리상담사 매칭 및 상담 서비스 제공
    - 작가 작품 판매 서비스 제공
3. **위탁기간**: 위탁계약 종료 시까지

### 제6조 [정보주체와 법정대리인의 권리·의무 및 그 행사방법]

정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.

1. 개인정보 열람 요구
2. 오류 등이 있을 경우 정정 요구
3. 삭제 요구
4. 처리정지 요구

### 제7조 [개인정보의 파기]

회사는 원칙적으로 개인정보 처리 목적이 달성된 경우에는 지체 없이 해당 개인정보를 파기합니다. 파기의 절차, 기한 및 방법은 다음과 같습니다.

1. **파기절차**: 정보주체가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져 내부 방침 및 기타 관련 법령에 따라 일정 기간 저장된 후 혹은 즉시 파기됩니다.
2. **파기기한**: 정보주체의 개인정보는 개인정보의 보유기간이 경과된 경우, 처리 목적 달성, 해당 서비스의 폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는 지체 없이 파기합니다.
3. **파기방법**: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용합니다.

### 제8조 [개인정보 보호책임자]

회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.

1. **개인정보 보호책임자**
    - 성명: 옥세원
    - 직책: 대표
    - 연락처: 이메일 (dhrtpdnjs@gmail.com)

### 제9조 [개인정보 처리방침의 변경]

이 개인정보 처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경 내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 홈페이지의 '공지사항'을 통하여 고지할 것입니다.

- 공고일자: 2024년 6월 23일
- 시행일자: 2024년 6월 23일

**심심조각**은 정보주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할 수 있도록 최선을 다하겠습니다.
`;

export default policy;
