// terms.ts
const terms = `
# 심심조각 이용약관

### 제1조 [목적]

본 약관은 심심조각(이하 ‘회사’)에서 제공하는 서비스를 이용하는 이용자 및 회원의 권리, 의무 및 책임사항,
기타 필요한 사랑을 규정함을 목적으로 합니다.

### 제2조 [용어의 정리]

1. 서비스
    
    유ㆍ무선 단말기의 종류와는 상관없이 이용 가능한 회사가 제공하는 모든 서비스를 의미합니다.
    
2. 회원
    
    회사와 이용계약을 체결하고 외사가 공지하는 정보를 받으며 회사가 제공하는 서비스를 이용할 수 있는 자를 말합니다.
    
3. 계정
    
    회사가 회원가입 시 회원의 동일성, 로그인, 결제정보 등을 관리할 수 있도록 회원정보의 식별 목적으로 발급하는 것으로 회원의 가입 시 사용한 e-mail 정보를 의미합니다.
    
4. 유료서비스
    
    회사가 제공하는 서비스 중 회원이 회사가 유료로 제공하는 각종 서비스를 사용하기 위해 일정 금액을 지급하거나,
    회원이 회사 또는 제삼자와의 거래나 약정 조건을 수락하는 경우에 이용할 수 있는 회사의 서비스를 의미합니다.
    
5. 구독회원
    
    유료서비스를 이용 중인 회원을 의미합니다.
    회사는 구독회원과 구독회원이 아닌 회원, 그리고 유료로 제공하는 서비스구매 여부에 따라 제공하는 서비스에 차별을 두어 제공할 수 있습니다.
    
6. 모욕적 언행
    
    욕설, 비방, 모욕, 모독, 혐오발언, 언어폭력 등 타인의 명예를 훼손하거나 불쾌감을 주는 모든 언어적 행동을 의미합니다.
    
7. 결제
    
    회사가 제공하는 유로서비스를 이용하기 위하여 각종 지불수단을 통하여 일정금액을 회사 또는 회사가 정한 제삼자에 지급하는 것을 의미합니다.
    
8. 정기구독
    
    회원이 유료서비스를 이용하기 위해 미리 등록한 결제수단을 통하여 월/년 단위의 이용기간에 대한 이용요금이 정기적으로 결제되고,
    이용기간이 자동 갱신되는 유료서비스 이용방식을 말합니다.
    정기구독을 해지하면 결제가 이루어진 유료서비스의 남은 이용기간 동안은 유료서비스를 정상이용할 수 있고,
    다음 이용기간부터 자동 결제가 이루어지지 않습니다.
    
9. 구독취소
    
    회원이 유료서비스의 결제를 취소하고 유료서비스의 이용을 바로 중단하는 것을 의미합니다.
    구독취소에 따른 환급은 본 이용약관의 규정에 따릅니다.
    
10. 해지
    
    회원이 심심조각서비스를 더는 이용하지 않음에 대한 의사를 본 약관에 정한 방법으로 회사에 통지하는 것을 말합니다.
    

### 제3조 [약관의 효력 및 변경]

1. 본 약관은 서비스를 이용하고자 하는 모든 회원에게 그 효력이 발생합니다.
2. 회사는 이 약관의 내용을 회원이 쉽게 할 수 있도록 서비스 초기화면에 게시합니다.
3. 회원이 회사의 서비스 이용을 위해 회원가입을 진행했을 때 본 약관의 내용을 모두 읽고 이를 이해하였으며,
회사가 운영하는 서비스를 지속해서 사용하는 것에 동의함을 의미합니다.
4. 회사가 약관을 개정할 때는 적용 일자 및 개정사유를 명시하며 그 적용 일자 최소 7일 이전부터 적용 일자 전날까지 로그인 화면 앱 알림창으로 공지합니다.
5. 회원은 개정된 약관에 대해 거부할 권리가 있으며,
개정된 약관에 동의하지 않으면 이용계약 해지를 요청할 수 있으며, 개정된 약관의 효력 발생일 이후에도 서비스를 계속 이용할 경우 약관의 변경사항에 동의하는 것으로 간주합니다.
6. 회사는 ‘약관의 규제에 관한 법률’, ‘정보통신망이용촉진 및 정보보호에 관한 법률(이하 ‘정보통신망법’)’,
‘전자상거래 등에서의 소비자 보호에 관한 법률’, ‘전자거래기본법’등 관련법을 위배하는 않는 범위에서 이 약관을 개정할 수 있습니다.
7. 이 약관은 회원이 이 약관에 동의한 날로부터 회원 탈퇴 시까지 적용하는 것을 원칙으로 합니다. 단, 이 약관의 일부 조항은 회원 탈퇴 후에도 유효하게 적용될 수 있습니다.

### 제4조 [회사의 의무]

1. 회사는 관련 법령과 본 약관에 반하는 행위를 하지 않으며, 지속적이고 안정적인 서비스의 제공을 위하여 최선을 다하여 노력합니다.
2. 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용 정보 포함)보호를 위해 보안 시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다.
3. 회사는 국가비상사태, 정전, 천재지변, 정기점검, 서비스 설비의 장애 또는 서비스 사용의 폭주 등으로 정상적인 서비스 제공이 불가능할 경우,
콘텐츠의 전부 또는 일부를 제한하거나 중지할 수 있습니다.
다만, 이 경우 그 사유 및 기간 등을 회원에게 사전 또는 사후에 공지합니다.
4. 회사는 서비스 이용과 관련하여 회원으로부터 제기된 의견이나 불만이 정당하다고 인정할 경우 이를 처리하여야 하며,
회원에게 처리 과정 및 경과를 전달합니다.
5. 타인에게 모욕적인 언사를 행하였을 때 회사는 회원에게 서비스 이용을 제한할 수 있습니다.

### 제5조 [전문가의 권리 및 의무]

1. 전문가는 회사의 서비스를 통해 회원에게 용역을 제공할 수 있습니다.
2. 전문가는 회사의 요청이 있는 경우, 서비스와 관련된 자격증 정보 등 최소한의 정보를 회사에 공개해야 합니다.
단, 정보를 전달함에 거짓이 없어야 하며, 회사가 관련 증명서류를 요청할 경우 이에 응해야 합니다.
3. 전문가는 회사 서비스의 지적재산권을 침해하는 행위를 해서는 안 됩니다.
4. 전문가는 서비스를 위해 이용자의 마음검사 등을 열람할 수 있습니다.
5. 전문가는 회원의 개인정보를 본 약관에서 정한 목적 이외의 용도로 사용하거나 제삼자에게 제공하는 등 외부에 유출할 수 없으며,
관련 법령, 본 약관, 운영정책 등에 따라 철저히 보호하여야 합니다.
6. 전문가는 서비스 제공과정에서 획득한 회원정보와 상담내용에 대하여 비밀준수의무를 지닙니다.
7. 전문가가 본 조를 위반하여 회원 등으로부터 문제 제기가 있는 경우, 회사에서 면책시켜야하며,
전문가 본인이 관련 법령에 따른 민, 형사상 법적 책임 등 일체의 책임을 직접 부담하여야 합니다.
8. 전문가는 회사의 서비스 개선을 위해 정기적으로 피드백을 제공해야 하며,
이를 통해 서비스의 질적 향상을 도모해야 합니다.
9. 전문가는 회원과의 상담내용을 철저히 기록하고, 이를 안전하게 보관해야 합니다.
기록은 법적 요구나 회사의 정책에 따라 필요할 때 제공할 수 있도록 관리되어야 합니다.

### 제6조 [회원의 의무]

1. 회원은 관계 법령, 이 약관의 규정, 개인정보처리방침, 기타 서비스별 안내 등 회사가 통지하는 사항을 준수하여야 합니다.
2. 회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는 안 됩니다.
    - 다른 회원의 개인정보를 부정 사용하는 행위
    - 회사 및 제3자의 저작권 등 지적재산권을 침해하는 행위
    - 회사의 사전 승낙 없이 서비스를 이용하여 영리목적의 활동을 하는 행위
    - 모욕적 언행을 포함한 기타 불법적이거나 부당한 행위
    - 해킹행위 또는 컴퓨터바이러스의 유포행위
    - 기타 회사가 서비스 운영상 부적절하다고 판단되는 행위
    - 회사의 동의 없이 서비스, 콘텐츠 또는 이에 포함된 소프트웨어 일부를 복사, 수정, 배포, 판매, 양도, 대여하거나
    타인에게 그 이용을 허락하는 행위와 소프트웨어를 역설계 하거나 소스코드의 추출을 시도하는 등
    서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위
    - 회사의 운영자, 임직원, 회사를 사칭하거나 관련 정보를 도용하는 행위
    - 자신의 재산상 이익 도는 즐거움을 위하여 회사 또는 회사의 서비스와 관련된 허위의 정보를 유통하거나 비정상적으로 서비스를 이용하는 행위
    - 고객센터 문의 시 욕설, 폭언, 성희롱, 반복적인 민원을 통해 업무를 방해하는 행위
3. 회사는 회원이 전 항에서 금지한 행위를 하는 경우, 위반 행위의 경중에 따라 서비스의 이용정지, 계약의 해지 등 서비스 이용제한, 수사 기관에의 고발 조치 등 합당한 조치를 취할 수 있습니다.
4. 회원은 상담에 필요한 최소한의 구체적이고 진실한 정보를 제공하여야 하며, 정보가 부족할 경우, 서비스 이용에 제한을 받을 수 있습니다.
5. 회원은 상품 등을 구매하기 전에 반드시 회사가 제공하는 상품 등의 상세 내용과 조건을 정확하게 확인한 후 구매해야 합니다.
회원이 이를 확인하지 않았거나 오인하여 발생한 문제에 대해서는 회사는 회사의 고의 혹은 과실이 없는 한 책임을 지지 않습니다.
6. 회사는 회원이 본 조에서 규정한 의무를 위반하여 발생한 일체의 문제에 관해서는 책임을 지지 않습니다.

### 제7조 [회원의 권리]

1. 회원은 언제든지 서비스 탈퇴를 요청할 수 있으며, 회사는 즉시 회원 탈퇴를 처리합니다.
2. 회원은 본인의 개인정보가 보호받을 수 있도록 관련 법령에 따른 권리를 행사할 수 있습니다.

### 제8조 [개인정보 보호 및 관리]

1. 회사는 서비스를 제공하는 데 필요한 최소한의 회원 개인정보를 수집할 수 있습니다.
2. 회사는 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다.
회원이 회사에 제공하는 정보 일체는 회사의 개인정보 처리방침에 따릅니다.
단, 회사의 공식사이트와 애플리케이션 이외의 회사에 링크되어있는 웹사이트 들에서는 회사의 개인정보처리방침이 적용되지 않습니다.
3. 회사는 회원이 이용신청 등에서 제공한 정보와 제1항에 의하여 수집한 정보를 회원의 동의 없이 목적 외로 이용하거나 제3자에게 제공할 수 없으며,
이를 위반한 경우에 모든 책임은 회사가 집니다.
다만 다음은 예외로 합니다.
    1. 통계작성, 학술 연구 또는 시장 조사와 상담을 위하여 필요한 경우로서 특정 개인을 식별할 수 없는 형태로 제공하는 경우
    2. 콘텐츠 제공에 따른 요금 정산을 위하여 필요한 경우
    3. 약관의 규정 또는 법령에 따라 필요한 불가피한 사유가 있는 경우
    4. 도용 방지를 위하여 본인확인에 필요한 경우
4. 회원은 언제든지 제3항의 동의를 임의로 철회할 수 있으나 서비스 제공에 필요한 정보의 수집 또는 제공 동의를 철회할 경우 서비스의 제공이 제한될 수 있습니다.
5. 회사는 회사의 귀책 없이 회원의 귀책사유로 회원의 정보가 노출된 경우 이에 관해서는 책임을 지지 않습니다.
6. 회사는 회원에게 서비스 관련 공지사항 및 행정적 사항을 제공할 필요가 있을 수 있습니다.
이러한 사항은 본 서비스 및 회원계정 일부로 간주하며, 회원은 이를 수신 거부할 수 없습니다.

### 제9조 [서비스 로그인/회원가입]

1. 회원은 회사의 서비스 이용을 위해서 SNS 간편 가입으로 로그인/회원가입을 할 수 있습니다.
2. 모든 이용자는 반드시 본인의 Google, apple 계정으로 로그인/회원가입을 완료해야 합니다.
3. 회사는 회원이 본 서비스의 이용을 시작한 경우 본 약관에 동의한 것으로 간주하고, 회원 가입계약이 체결됩니다.
4. 회사는 각 호에 해당하는 경우에는 승낙을 유보하거나 거절할 수 있으며,
사후에 이용계약을 해지할 수 있습니다.
    1. 본 약관에 의하여 이전에 회원자격을 잃은 적이 있는 경우
    2. 타인의 명의를 이용한 경우
    3. 관계 법령, 기타 규정한 제반 사항을 위반하여 신청하는 경우
5. 회원은 자신의 계정 및 비밀번호가 도용되었거나 유출된 것을 인지한 즉시 회사에 통지하고 회사의 안내에 따라야 합니다.
회사에 그 사실을 통지하지 않거나 통지한 경우라도 회사의 안내를 따르지 않아 발생한 불이익에 대해서
회사는 회사의 고의 또는 과실이 없는 한 책임지지 않습니다.

### 제10조 [광고의 제공]

1. 회사는 서비스 운영과 관련하여 회원이 입력한 정보를 활용하여 광고를 게재할 수 있습니다.
회원은 서비스 이용 시 노출되는 맞춤 광고 게재에 대해 동의합니다.
2. 회사는 서비스 이용 중 필요하다고 인정되는 다양한 정보를 콘텐츠 화면, 공지사항, 이메일 등의 방법으로 회원에게 제공할 수 있습니다.
3. 회사는 서비스상에 게재되어있거나 서비스를 통한 광고주의 판촉활동에 회원이 참여하는 등
 교신 또는 거래를 함으로써 발생하는 손실과 손해에 관해 책임을 지지 않습니다.
4. 회사가 제공하는 서비스 등 배너 또는 링크 등을 통해 타인이 제공하는 광고나 서비스에 연결될 수 있습니다.
5. 제2항에 따라 타인이 제공하는 광고나 서비스에 연결될 경우 해당 영역에서 제공하는 서비스는 회사의 서비스 영역이 아니므로
회사가 신뢰성, 안정성 등을 보장하지 않으며, 거래나 약정 사용자의 손해에 대하여도 회사는 책임을 지지 않습니다.
다만, 회사가 고의 또는 중과실로 손해의 발생을 용이하게 하거나 손해 방지를 위한 조치를 취하지 아니하면 그러하지 아니합니다.

### 제11조 [유료 콘텐츠의 구매, 사용기간 및 이용]

1. 서비스 내에서 이용자가 구매한 유료 콘텐츠는 해당 애플리케이션에 가입할 때 사용한 SNS 간편 가입 아이디로만 이용할 수 있습니다.
2. 회사는 정기구독 유료서비스를 제공하며, 회사의 사정, 기타 여러 가지 여건에 따라 서비스 내용을 추가하거나 변경할 수 있습니다.
3. 회사는 권리자 등의 요청이 있게 되는 경우, 해당 요청에 따라 유료서비스를 지원하는 기기의 종류 등을 변경할 수 있습니다.

### 제12조 [유료서비스의 변경]

1. 회사는 운영상, 기술상의 필요에 따라 공급하는 유료서비스 가액을 변경할 수 있으며, 회원에게 사전공지합니다.
2. 애플 및 구글을 IAP를 통해 결제되는 유료 서비스는 애플 및 구글 각 사의 정책에 따라 수수료를 고려하여 다른 가격으로 판매될 수 있습니다.
3. 회사가 제휴를 통해 회원에게 유료서비스를 제공하는 경우 해당 제휴사의 정책을 따릅니다.
4. 이용자가 구매한 유료 콘텐츠의 이용기간은 구매 시 명시된 기간에 따릅니다.
다만, 서비스 중단이 이루어지는 경우 기간의 정함이 없는 유료 콘텐츠의 이용기간은 서비스 중단 공지 시, 공지된 서비스의 중단 일자까지로 합니다.

### 제13조 [유료서비스 이용에 관한 해제 · 해지]

1. ~~정기구독 방식의 유료서비스는 관리메뉴를 통해 정기구독을 해지할 수 있습니다.
회원이 정기구독을 해제·해지했을 경우, 다음 이용기간부터 유료서비스에 대한 자동결제가 이루어진 유료서비스의 남은 이용기간 동안은 유료서비스를 정상이용할 수 있습니다.~~
2. 회원이 구매한 재화 또는 서비스를 이용한 이후에 중도 해지 또는 환급을 요청할 경우 환급이 불가합니다.
3. 회사는 회원에게 구독취소를 이유로 위약금 또는 손해배상을 청구하지 않으며,
회원의 계약해제·해지는 손해배상의 청구에 영향을 미치지 않습니다.
4. 유료서비스를 유지하고자 하는 유료회원은 이용요금의 체납 또는 결제수단의 연체가 발생하지 않도록 사전에 조치하여야 합니다.
5. 유료서비스 이용계약 중인 회원은 유료서비스 이용계약 해지 후 탈퇴가 가능합니다.
6. 이벤트를 통해 받은 재화 또는 상품권을 현금으로 바꾸고자 환급을 요청할 경우 환급이 불가합니다.
7. 회원이 구매한 재화 또는 상품권, 구독서비스는 구매 후 일주일 이내 환급 요청 시 사용하지 않았다는 전제하에 환급이 가능합니다.
하지만 해당 기간을 넘었을 때 환급이 불가능합니다.

### 제14조 [저작권]

1. 회사가 제작, 제공하는 서비스, 회사가 개발한 검사지, 해설지 및 기타 모든 저작물에 대한 저작권, 기타 지적재산권 및 기타 모든 콘텐츠는 회사에 귀속됩니다.
2. 이용자는 회사가 제공하는 서비스를 이용하여 얻은 정보 중에서 회사 또는 제공업체에 지적재산권이 귀속된 정보를 회사
또는 제공업체의 사전 동의 없이 복제 · 전송 등의 방법(편집, 공표, 공연, 배포, 방송, 2차적 저작물 작성 등을 포함합니다.) 에 의하여
영리목적으로 이용하거나 타인에게 이용하게 하여서는 안 됩니다.
3. 회원과 전문가가 상담과정에서 작성하는 상담내용과 게시하는 글 또는 회사가 운영하는 플랫폼에 게시하는 글 등
저작물의 저작권 또는 저작물의 이용권은 회사에 무상으로 영구적으로 귀속되며,
회사는 모든 자료와 정보를 익명화하여 수집하고 심리상담과 관련한 연구 및 개발, 통계, 마케팅에 활용할 수 있습니다.
또한, 빅데이터 활용 또는 연구를 위해 제삼자에게 재이용권을 허락할 수 있습니다.
4. 회원이 서비스 내에 게시한 게시물에 대해
회사는 서비스의 운영, 전시, 전송, 배포, 홍보의 목적으로 별도의 회원 허락 없이 무상으로 저작권법에 규정하고
공정한 관행에 합치되는 합리적인 범위 내에서 회원이 등록한 게시물을 익명화하여 사용할 수 있습니다.

### 제15조 [책임 제한]

1. 회사는 약관, 서비스 이용 방법 및 이용 기준을 준수하는 않는 등 회원의 귀책사유로 인한 서비스 이용의 장애에 관한 책임을 지지 않습니다.
    1. 회원이 자신의 아이디 또는 비밀번호 등의 관리를 소홀히 한 경우
    2. 회원의 귀책사유 때문에 서비스 이용의 장애가 발생한 경우
    3. 서비스용 설비의 보수, 교체, 정기점검, 공사 등의 부득이한 사유로 손해가 발생할 경우
    4. 기간통신 사업자가 전기통신 서비스를 중지하거나 정상적으로 제공하지 아니하여 손해가 발생한 경우
    5. 서비스 제공을 위하여 회사와 서비스 제휴계약을 맺은 제삼자의 고의적인 서비스 방해가 있는 경우
    6. 회원이 서비스를 이용하여 기대하는 수익을 얻지 못하거나 상실한 경우
    7. 회원이 검사지와 해설지 등 회사에서 제공하는 콘텐츠가 맞지 않다고 판단하는 경우
    8. 회원이 매칭된 상담사 혹은 AI 상담사와의 대화를 통해 기대하는 바를 이루지 못한 경우
    9. 회원이 서비스를 이용하며 상담사에게 정신적 피해를 입힌 경우
    10. 기타 회사의 귀책사유가 없는 통신서비스 등의 제삼자에
2. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.
3. 회사는 회원이 회사의 서비스 제공으로부터 기대되는 이익을 얻지 못하였거나
서비스로부터 수반되는 잠재가치 및 서비스에 대한 취사선택 또는 이용으로 발생하는 손해 등에 대해서는 책임이 없습니다.
4. 회사는 무료로 제공되는 서비스의 일부 또는 전부를 회사의 정책, 운영상의 긴요한 사유로 수정, 중단, 변경할 수 있으며,
이에 대하여 관련 법령에 별도 규정이 있지 아니하는 한 별도의 보상을 하지 않습니다.
5. 회사는 회원에게 플랫폼 또는 서비스를 제공하는 역할을 담당하며, AI 또는 전문가의 상담 내용에 대한 진위 등을 판단할 수 없습니다.

### 제 16조 [재판권 및 준거법]

1. 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.
2. 회사와 회원간에 발생한 분쟁에 관한 소송에는 대한민국 법을 적용합니다.
3. 회사와 회원간에 발생한 전자상거래 분쟁과 관련하여 회원의 피해구제 신청이 있는 경우에는 공정거래 위원회 또는 시도지사가 의뢰하는 분쟁조정기관의 조정에 따를 수 있습니다.
4. 서비스 이용으로 발생한 분쟁에 대해 소송이 제기되는 경우 민사소송법상의 관할 법원에 제소합니다.

### 부칙

1. 공지 일자: 2024년 6월 27일
2. 적용 일자: 2024년 6월 27일
`;

export default terms;
